Revit 2027 API
RenderingSettings.GetRenderingQualitySettings Method
 Returns an object that represents the rendering quality settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RenderingQualitySettings GetRenderingQualitySettings()
Public Function GetRenderingQualitySettings As RenderingQualitySettings
public:
RenderingQualitySettings^ GetRenderingQualitySettings()
member GetRenderingQualitySettings : unit -> RenderingQualitySettings
Return Value
RenderingQualitySettings
 The rendering quality settings.
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace